Revit 2027 API
ParameterTypeId.GbxmlEditDataParam Property
 "Energy Settings"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId GbxmlEditDataParam { get; }
Public Shared ReadOnly Property GbxmlEditDataParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ GbxmlEditDataParam {
	ForgeTypeId^ get ();
}
static member GbxmlEditDataParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace